Revit 2027 API
Ceramic.CeramicPatternMap Property
 The property labeled "Image" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string CeramicPatternMap { get; }
Public Shared ReadOnly Property CeramicPatternMap As String
	Get
public:
static property String^ CeramicPatternMap {
	String^ get ();
}
static member CeramicPatternMap : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
See Also
Reference
Ceramic Class
Autodesk.Revit.DB.Visual Namespace